-- --------------------------------------------------------
-- Хост:                         127.0.0.1
-- Версия сервера:               5.6.43 - MySQL Community Server (GPL)
-- Операционная система:         Win32
-- HeidiSQL Версия:              10.2.0.5599
-- --------------------------------------------------------

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET NAMES utf8 */;
/*!50503 SET NAMES utf8mb4 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;

-- Дамп структуры для таблица db_drm.doc_paragraph
CREATE TABLE IF NOT EXISTS `doc_paragraph` (
  `PARAGRAPH_ID` int(11) NOT NULL AUTO_INCREMENT,
  `PARAGRAPH_No` int(11) DEFAULT NULL,
  `PARAGRAPH_NAME` varchar(250) DEFAULT NULL,
  `SECTION_ID` int(11) DEFAULT NULL,
  PRIMARY KEY (`PARAGRAPH_ID`),
  KEY `FK_doc_paragraph_doc_section_SECTION_ID` (`SECTION_ID`),
  CONSTRAINT `FK_doc_paragraph_doc_section_SECTION_ID` FOREIGN KEY (`SECTION_ID`) REFERENCES `zajava_section` (`SECTION_ID`) ON DELETE CASCADE ON UPDATE CASCADE
) ENGINE=InnoDB AUTO_INCREMENT=52 DEFAULT CHARSET=utf8 COMMENT='Подразделы заявки';

-- Дамп данных таблицы db_drm.doc_paragraph: ~52 rows (приблизительно)
DELETE FROM `doc_paragraph`;
/*!40000 ALTER TABLE `doc_paragraph` DISABLE KEYS */;
INSERT INTO `doc_paragraph` (`PARAGRAPH_ID`, `PARAGRAPH_No`, `PARAGRAPH_NAME`, `SECTION_ID`) VALUES
	(1, 1, 'Повна назва структурного підрозділу, в якому відкрита вакансія', 1),
	(2, 2, 'Найменування вакантної посади', 1),
	(3, 7, 'Освіта', 2),
	(4, 8, 'Пріоритетні ВНЗ', 2),
	(5, 9, 'Досвід роботи (сфера діяльності, стаж)', 2),
	(6, 10, 'Найменування підприємств, фірм та компаній, які можуть зацікавити в першу чергу', 2),
	(7, 15, 'Операційні системи та програми Microsoft Word Microsoft Exel', 3),
	(8, 16, 'Спеціальні програми/пакети/бази даних AutoCAD, Map.Info', 3),
	(9, 19, 'Перелік службових обов\'язків, які передбачені посадою', 4),
	(10, 20, 'Графік роботи', 4),
	(11, 23, 'Рівень заробітної плати, яку буде отримувати робітником', 5),
	(12, 24, 'Додаткові виплати', 5),
	(13, 25, 'Компенсаційний пакет', 5),
	(14, 26, 'Офісний стіл', 6),
	(15, 27, 'Крісло/стілець', 6),
	(16, 28, 'Додатково', 6),
	(17, 29, 'Стаціонарний персональний компьютер', 7),
	(18, 32, 'Принтер', 7),
	(19, 30, 'Ноутбук', 7),
	(20, 35, 'ЗУП', 8),
	(21, 36, '1С Бухгалтерія', 8),
	(22, 38, 'IP телефон', 9),
	(23, 39, 'Sim-карта', 9),
	(24, 41, 'Канцелярські приладдя', 10),
	(25, 42, 'Костюм бавовняний', 11),
	(26, 46, 'Футболка бавовняна', 11),
	(27, 48, 'Халат білий медичний', 11),
	(28, 3, 'П.І.Б. директора з напрямку', 1),
	(29, 4, 'П.І.Б. начальника управління', 1),
	(30, 5, 'П.І.Б. безпосереднього керівника', 1),
	(31, 6, 'Причина виникнення вакансії', 1),
	(32, 11, 'Кандидат має професійні знання в таких сферах:', 2),
	(33, 12, 'Спеціальні знання та навички', 2),
	(34, 13, 'Особисті якості, необхідні для даної посади', 2),
	(35, 14, 'Знання іноземних мов та рівень їх володіння', 3),
	(36, 17, 'Язики програмування', 3),
	(37, 18, 'Інше', 3),
	(38, 21, 'Відрядження (тривалість, частота)', 4),
	(39, 22, 'Перспективи росту (посада, сроки)', 4),
	(40, 31, 'Зовнішні пристрої (подовжувачі USB, модеми, роутери і т.д.)', 7),
	(41, 32, 'Сканер', 7),
	(42, 33, 'БФП', 7),
	(43, 34, 'Документообіг', 8),
	(44, 37, 'Industry', 8),
	(45, 40, 'Електронна пошта', NULL),
	(46, 43, 'Костюм брезентовий', 11),
	(47, 44, 'Халат бавовняний', 11),
	(48, 45, 'Комбінезон бавовняний', 11),
	(49, 47, 'Напівкомбінезон', 11),
	(50, 49, 'Кепка робоча', 11),
	(51, 50, 'Шапка утеплена', 11);
/*!40000 ALTER TABLE `doc_paragraph` ENABLE KEYS */;

/*!40101 SET SQL_MODE=IFNULL(@OLD_SQL_MODE, '') */;
/*!40014 SET FOREIGN_KEY_CHECKS=IF(@OLD_FOREIGN_KEY_CHECKS IS NULL, 1, @OLD_FOREIGN_KEY_CHECKS) */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
